from datetime import datetime

import pandas as pd
import pytest


@pytest.fixture
def sample_data():
    data = {
        "Дата операции": [
            datetime(2021, 12, 31, 0, 12, 53),
            datetime(2021, 12, 30, 2, 2, 0),
            datetime(2021, 12, 30, 19, 18, 22),
            datetime(2021, 12, 30, 19, 6, 39),
            datetime(2021, 12, 29, 16, 22, 8),
            datetime(2021, 12, 29, 14, 15, 35),
            datetime(2021, 12, 28, 18, 24, 24),
            datetime(2021, 12, 26, 13, 50, 58),
        ],
        "Номер карты": ["*7197", "*5091", "*7197", "*5091", "*4556", "*4556", "*4556", "5091"],
        "Сумма операции": [-78.05, -20000, -1.32, -1411.4, -35, -35, -600, -100.2],
        "Описание": [
            "Ситидрайв",
            "Ситидрайв",
            "Магнит",
            "Пополнение через Газпромбанк",
            "РЖД",
            "РЖД",
            "Rumyanyj Khleb",
            "Ozon.ru",
        ],
        "Категория": [
            "Супермаркеты",
            "Супермаркеты",
            "Переводы",
            "Фастфуд",
            "Фастфуд",
            "Каршеринг",
            "Константин Л.",
            "Константин Л.",
        ],
    }
    return pd.DataFrame(data)
